##  Terraform Plan — DEV Environment
| Step | Result |
|------|--------|
| Format | `success` |
| Validate | `success` |
| Plan | `success` |

<details><summary>Show Plan Output</summary>

```
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.eks.aws_cloudwatch_log_group.eks_cluster_logs: Refreshing state... [id=/aws/eks/mlops-infr-dev-eks/cluster]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-02d15fcaa99aada0d]
module.bastion.data.aws_ami.amazon_linux: Reading...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 0s [id=3552664922]
module.eks.aws_iam_role.worker_nodes_role: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=mlops-infr-dev-eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181627712600000004]
module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181627712100000003]
module.eks.aws_iam_role_policy_attachment.worker_nodes_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181628067100000005]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260303181627321900000001]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260303181627383300000002]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]
module.bastion.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-031f713803bf2f9f2]
module.vpc.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-026a3b06654c18419]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-000f346eedf442497]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-0e4fe0f87bcf077bd]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-0233338d1e3185d55]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-07bb1f8ab585ef90c]
module.security_group.aws_security_group.eks_control_plane: Refreshing state... [id=sg-077ccc0914f6ff811]
module.security_group.aws_security_group.eks_worker_nodes: Refreshing state... [id=sg-0d7ef37710d9d8f06]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-0568fcff7af3f1512]
module.vpc.aws_eip.eip_nat["1"]: Refreshing state... [id=eipalloc-07130b3df2317cae3]
module.vpc.aws_eip.eip_nat["0"]: Refreshing state... [id=eipalloc-09ac658248194f808]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-065afd68d04d5ffd3]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0e1195021f6d797c9]
module.eks.aws_eks_cluster.main: Refreshing state... [id=mlops-infr-dev-eks]
module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet: Refreshing state... [id=sgrule-142255494]
module.security_group.aws_security_group_rule.control_plane_to_nodes_https: Refreshing state... [id=sgrule-306891872]
module.security_group.aws_security_group_rule.nodes_to_control_plane_https: Refreshing state... [id=sgrule-318599478]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-070923cfd01c52adf]
module.vpc.aws_nat_gateway.nat_gateway["1"]: Refreshing state... [id=nat-0f30a669b18af461b]
module.vpc.aws_nat_gateway.nat_gateway["0"]: Refreshing state... [id=nat-0fc11116439535195]
module.vpc.aws_route_table.private_route_table["0"]: Refreshing state... [id=rtb-031e42be8f78fb63b]
module.vpc.aws_route_table.private_route_table["1"]: Refreshing state... [id=rtb-085c04218554e3a7c]
module.eks.aws_eks_node_group.main: Refreshing state... [id=mlops-infr-dev-eks:mlops-infr-dev-eks-node-group]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0ae54c8ca9b35a3cf]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0ca64c3f32cef0444]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion_host will be created
  + resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-031f713803bf2f9f2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion-host"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-000f346eedf442497"
      + tags                                 = {
          + "Name" = "KLTN-Bastion-Host"
        }
      + tags_all                             = {
          + "Name" = "KLTN-Bastion-Host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic to Bastion Host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from allowed CIDR only"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "bastion-ssh-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "KLTN-Bastion-Host-sg"
        }
      + tags_all               = {
          + "Name" = "KLTN-Bastion-Host-sg"
        }
      + vpc_id                 = "vpc-02d15fcaa99aada0d"
    }

  # module.security_group.aws_security_group.eks_control_plane will be updated in-place
  ~ resource "aws_security_group" "eks_control_plane" {
        id                     = "sg-077ccc0914f6ff811"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Kubernetes API - HTTPS from worker nodes"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d7ef37710d9d8f06",
                ]
              - self             = false
              - to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "KLTN-Project-DEV-eks-cp-20260303181637178000000006"
        tags                   = {
            "Name" = "KLTN-Project-DEV-eks-control-plane-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.eks_worker_nodes will be updated in-place
  ~ resource "aws_security_group" "eks_worker_nodes" {
        id                     = "sg-0d7ef37710d9d8f06"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "HTTPS from EKS control plane (webhook aggregation)"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-077ccc0914f6ff811",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Kubelet API - from EKS control plane"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-077ccc0914f6ff811",
                ]
              - self             = false
              - to_port          = 10250
            },
            # (5 unchanged elements hidden)
        ]
        name                   = "KLTN-Project-DEV-eks-nodes-20260304040713260500000003"
        tags                   = {
            "Name" = "KLTN-Project-DEV-eks-worker-nodes-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + bastion_host_public_ip              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

>*Commit: `e9022616c11ee6a4ae984929cd97cb23af529523`*